app/controllers/posts_controller.rb

	def update
	  # @post = Post.find(params[:id])
	  # @post.update(title: params[:title], description: params[:description])
	  # redirect_to post_path(@post)
		@post = Post.find(params[:id])
	  @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "This just a film!\r\nNo worries!"], ["updated_at", "2019-01-19 21:10:53.799639"], ["id", 5]]